SoliQuiz/app/Http/Controllers/Web/AdminController.php

select * from `users` where `users`.`id` in (2)
---
    public function updateUser(Request $request, $id)
    {
        $user = User::findOrFail($id);