SoliQuiz/app/Http/Controllers/Web/AdminController.php

    public function gestionUtilisateurs()
    {
        // On récupère tous les utilisateurs
        // Dans une app réelle, on utiliserait $this->userService->paginate()
        $users = User::all();
---
select * from `users`

    public function pedagogie()
    {
        // On charge l'arborescence complète pour l'affichage master-detail
        $seances = Seance::with(['unitesApprentissage.competences'])->orderBy('date', 'desc')->get();
---
select * from `seances` order by `date` desc
select * from `unites_apprentissage` where `unites_apprentissage`.`seance_id` in (1, 2, 3, 4, 5)

    public function gestionClasses()
    {
        $classes = Classe::with(['formateur', 'etudiants'])->withCount('etudiants')->get();
        // Utilisation du type_profil pour plus de robustesse par rapport aux rôles Spatie
        $formateurs = User::where('type_profil', 'formateur')->orderBy('nom')->get();
---
select * from `users` where `type_profil` = 'formateur' order by `nom` asc

    public function assignFormateur(Request $request, $id)
    {
        $classe = Classe::findOrFail($id);
        $request->validate([
            'formateur_id' => 'required|exists:users,id'
        ]);
        $this->classeService->assignFormateur($classe, $request->formateur_id);
        return redirect()->route('admin.classes')->with('success', 'Formateur assigné avec succès à la classe.');
---
select * from `classes` where `classes`.`id` = '1' limit 1

    public function showClasse($id)
    {
        $classe = Classe::with(['formateur', 'etudiants'])->findOrFail($id);
        // On récupère les étudiants qui n'ont pas encore de classe pour pouvoir les ajouter
        // On utilise type_profil 'etudiant' pour correspondre au modèle User
        $etudiantsSansClasse = User::where('type_profil', 'etudiant')
            ->whereNull('classe_id')
            ->orderBy('nom')
            ->get();
---
select * from `users` where `type_profil` = 'etudiant' and `classe_id` is null order by `nom` asc