SoliQuiz/app/Http/Controllers/Web/StudentController.php

select * from `tentatives` where `etudiant_id` = 10
---
    public function bibliotheque()
    {
        $student = Auth::user();

        // Tous les QCM publiés (avec les infos tentées via le Service Public)
        $qcms = $this->qcmPublicService->getQcmsDisponibles($student);

        // Tentatives de l'étudiant complètes pour l'état courant
        $tentatives = Tentative::where('etudiant_id', $student->id)->get();

select * from `options` where `options`.`question_id` in (3)
select * from `qcms` where `qcms`.`id` = '2' limit 1
select * from `questions` where `questions`.`qcm_id` in (2)
---
    public function passation(Request $request, $id)
    {
        $qcm = QCM::with(['uniteApprentissage', 'questions.options'])->findOrFail($id);

select * from `tentatives` where `etudiant_id` = 10 and `qcm_id` = '2' and `statut` = 'en_cours' limit 1
---
    public function submitQcm(Request $request, $id)
    {
        $tentative = Tentative::where('etudiant_id', Auth::id())
            ->where('qcm_id', $id)
            ->where('statut', 'en_cours')
            ->firstOrFail();

select * from `qcms` where `qcms`.`id` = '1' limit 1
select * from `tentatives` where `etudiant_id` = 10 and `qcm_id` = 1 and `score_obtenu` is not null order by `date_fin` desc limit 1
select * from `options` where `options`.`question_id` in (1, 2)
select * from `questions` where `questions`.`qcm_id` = 1 and `questions`.`qcm_id` is not null
select * from `reponses` where `reponses`.`question_id` in (1, 2) and `tentative_id` = 6
select * from `choix_reponses` where `choix_reponses`.`reponse_id` = 7 and `choix_reponses`.`reponse_id` is not null
---
    public function resultats($id)
    {
        $qcm = QCM::with('uniteApprentissage')->findOrFail($id);
        $tentative = Tentative::where('etudiant_id', Auth::id())
            ->where('qcm_id', $qcm->id)
            ->whereNotNull('score_obtenu')
            ->latest('date_fin')
            ->firstOrFail();

        $questions = $qcm->questions()->with(['options', 'reponses' => function($q) use ($tentative) {
            $q->where('tentative_id', $tentative->id);
        }])->get();

        $questionDetails = $questions->map(function ($question) {
            $userReponse = $question->reponses->first();
            $selectedOptions = $userReponse ? $userReponse->choixReponses->pluck('option_id')->toArray() : [];
            $correctOptions = $question->options->where('est_correcte', true)->pluck('id')->toArray();

            $isCorrect = (count($correctOptions) === count($selectedOptions)) && empty(array_diff($correctOptions, $selectedOptions));

            return (object) [
                'texte' => $question->texte,
                'points' => $question->points,
                'explication' => $question->explication_feedback,
                'isCorrect' => $isCorrect,
                'options' => $question->options->map(function($opt) use ($selectedOptions) {
                    $opt->isSelected = in_array($opt->id, $selectedOptions);
                    return $opt;
                })
            ];