SoliQuiz/app/Services/DashboardService.php

select type_profil, COUNT(*) as total from `users` group by `type_profil`
select count(*) as aggregate from `classes`
---
    public function getKpis(): array
    {
        $counts = User::query()
            ->selectRaw('type_profil, COUNT(*) as total')
            ->groupBy('type_profil')
            ->pluck('total', 'type_profil');

        $tentativesStats = Tentative::where('statut', '!=', 'en_cours')
            ->selectRaw('COUNT(*) as total, AVG(score_obtenu) as moyenne')
            ->first();

        // Calcul du taux de réussite global (score >= score_reussite du QCM)
        // Pour simplifier on va dire score >= 10 ou utiliser la relation
        $nbSucces = Tentative::where('statut', 'reussi')->count();
        $tauxReussite = $tentativesStats->total > 0 ? round(($nbSucces / $tentativesStats->total) * 100) : 0;

        // Tendances indicatives basées sur les dates de création (30 derniers jours vs 30 précédents)
        $now = now();
        $lastMonthStart = $now->copy()->subDays(30);
        $prevMonthStart = $now->copy()->subDays(60);

        $newUsersLastMonth = User::where('created_at', '>=', $lastMonthStart)->count();
        $newUsersPrevMonth = User::where('created_at', '>=', $prevMonthStart)->where('created_at', '<', $lastMonthStart)->count();

        $trendUsers = $newUsersPrevMonth > 0 ? round((($newUsersLastMonth - $newUsersPrevMonth) / $newUsersPrevMonth) * 100) : 100;

        return [
            'nb_formateurs' => $counts['formateur'] ?? 0,
            'nb_etudiants' => $counts['etudiant'] ?? 0,
            'nb_classes' => Classe::count(),

select `qcms`.*, (select count(*) from `tentatives` where `qcms`.`id` = `tentatives`.`qcm_id`) as `tentatives_count` from `qcms` order by `tentatives_count` desc limit 5
select * from `qcms` where `qcms`.`id` in (1, 2, 3)
---
    public function getTopQcms(int $limit = 5): Collection
    {
        return QCM::withCount('tentatives')
            ->orderByDesc('tentatives_count')
            ->limit($limit)
            ->with('formateur')
            ->get();

select * from `tentatives` order by `created_at` desc limit 10
---
    public function getRecentTentatives(int $limit = 10): Collection
    {
        return Tentative::with(['etudiant', 'qcm'])
            ->latest()
            ->limit($limit)
            ->get();