SoliQuiz/app/Services/DashboardService.php

select COUNT(*) as total, AVG(score_obtenu) as moyenne from `tentatives` where `score_obtenu` is not null limit 1
select count(*) as aggregate from `qcms` where `est_publie` = 1
---
    public function getKpis(): array
    {
        $counts = User::query()
            ->selectRaw('type_profil, COUNT(*) as total')
            ->groupBy('type_profil')
            ->pluck('total', 'type_profil');

        $tentativesStats = Tentative::whereNotNull('score_obtenu')
            ->selectRaw('COUNT(*) as total, AVG(score_obtenu) as moyenne')
            ->first();

        return [
            'nb_formateurs' => $counts['formateur'] ?? 0,
            'nb_etudiants' => $counts['etudiant'] ?? 0,
            'nb_classes' => Classe::count(),
            'nb_qcms_publie' => QCM::where('est_publie', true)->count(),