SoliQuiz/app/Services/EtudiantService.php

    public function historique(User $etudiant, int $perPage = 10): LengthAwarePaginator
    {
        return Tentative::where('etudiant_id', $etudiant->id)
            ->whereIn('statut', ['reussi', 'echoue', 'abandonne'])
            ->with(['qcm.uniteApprentissage'])
            ->latest('date_fin')
            ->paginate($perPage);
---
select * from `qcms` where `qcms`.`id` in (1, 2)
select * from `tentatives` where `etudiant_id` = 10 and `statut` in ('reussi', 'echoue', 'abandonne') order by `date_fin` desc limit 5 offset 0
select count(*) as aggregate from `tentatives` where `etudiant_id` = 10 and `statut` in ('reussi', 'echoue', 'abandonne')

    public function getDashboard(User $etudiant): array
    {
        $tentatives = Tentative::where('etudiant_id', $etudiant->id)
            ->whereIn('statut', ['reussi', 'echoue'])
            ->with('qcm')
            ->get();
---
select * from `qcms` where `qcms`.`id` in (1, 2)
select * from `tentatives` where `etudiant_id` = 10 and `statut` in ('reussi', 'echoue')