SoliQuiz/app/Services/PassationService.php

select * from `tentatives` where `etudiant_id` = 10 and `qcm_id` = 2 and `statut` = 'en_cours' limit 1
insert into `tentatives` (`etudiant_id`, `qcm_id`, `statut`, `date_debut`, `updated_at`, `created_at`) values (10, 2, 'en_cours', '2026-04-20 14:55:07', '2026-04-20 14:55:07', '2026-04-20 14:55:07')
select * from `options` where `options`.`question_id` in (3)
select * from `qcms` where `qcms`.`id` in (2)
select * from `questions` where `questions`.`qcm_id` in (2)
---
    public function demarrer(User $etudiant, int $qcmId): Tentative
    {
        $existante = Tentative::where('etudiant_id', $etudiant->id)
            ->where('qcm_id', $qcmId)
            ->where('statut', 'en_cours')
            ->first();

        if ($existante) {
            return $existante->load('qcm.questions.options');
        }

        $tentative = Tentative::create([
            'etudiant_id' => $etudiant->id,
            'qcm_id' => $qcmId,
            'statut' => 'en_cours',
            'date_debut' => now(),
        ]);

        return $tentative->load('qcm.questions.options');

insert into `reponses` (`tentative_id`, `question_id`, `repondu_a`, `updated_at`, `created_at`) values (7, 3, '2026-04-20 14:55:22', '2026-04-20 14:55:22', '2026-04-20 14:55:22')
select * from `reponses` where (`tentative_id` = 7 and `question_id` = 3) limit 1
delete from `choix_reponses` where `choix_reponses`.`reponse_id` = 9 and `choix_reponses`.`reponse_id` is not null
insert into `choix_reponses` (`reponse_id`, `option_id`, `updated_at`, `created_at`) values (9, '9', '2026-04-20 14:55:22', '2026-04-20 14:55:22')
---
    public function enregistrerReponses(Tentative $tentative, array $answers): void
    {
        DB::transaction(function () use ($tentative, $answers) {
            foreach ($answers as $questionId => $optionIds) {
                $reponse = Reponse::updateOrCreate(
                    ['tentative_id' => $tentative->id, 'question_id' => $questionId],
                    ['repondu_a' => now()]
                );

                $reponse->choixReponses()->delete();

                if (!is_array($optionIds)) {
                    $optionIds = [$optionIds];
                }

                foreach ($optionIds as $optId) {
                    ChoixReponse::create([
                        'reponse_id' => $reponse->id,
                        'option_id' => $optId
                    ]);

select * from `options` where `options`.`question_id` in (3)
select * from `qcms` where `qcms`.`id` = 2 limit 1
select * from `questions` where `questions`.`qcm_id` in (2)
select * from `choix_reponses` where `choix_reponses`.`reponse_id` in (9)
select * from `reponses` where `reponses`.`tentative_id` = 7 and `reponses`.`tentative_id` is not null and `question_id` = 3 limit 1
---
    public function soumettre(Tentative $tentative): array
    {
        if ($tentative->statut !== 'en_cours') {
            return $this->buildResultat($tentative);
        }

        return DB::transaction(function () use ($tentative) {
            $qcm = $tentative->qcm->load('questions.options');
            $scoreTotal = 0;
            $scoreMax = 0;
            $corrections = [];

            foreach ($qcm->questions as $question) {
                $scoreMax += $question->points;

                $reponse = $tentative->reponses()
                    ->with('choixReponses')
                    ->where('question_id', $question->id)
                    ->first();

update `tentatives` set `score_obtenu` = 0, `statut` = 'echoue', `date_fin` = '2026-04-20 14:55:22', `tentatives`.`updated_at` = '2026-04-20 14:55:22' where `id` = 7
---
            $pourcentage = $scoreMax > 0 ? round(($scoreTotal / $scoreMax) * 100, 1) : 0;
            $reussi = $pourcentage >= $qcm->score_reussite;

            $tentative->update([
                'score_obtenu' => $pourcentage,
                'statut' => $reussi ? 'reussi' : 'echoue',
                'date_fin' => now(),
            ]);