SoliQuiz/app/Services/QcmPublicService.php

    public function getQcmsDisponibles(User $etudiant): Collection
    {
        return QCM::where('est_publie', true)
            ->with(['formateur', 'uniteApprentissage'])
            ->withCount('questions')
            ->withCount([
                'tentatives as mes_tentatives_count' => fn($q) =>
                    $q->where('etudiant_id', $etudiant->id),
            ])
            ->orderByDesc('created_at')
            ->get();
---
select `qcms`.*, (select count(*) from `questions` where `qcms`.`id` = `questions`.`qcm_id`) as `questions_count`, (select count(*) from `tentatives` where `qcms`.`id` = `tentatives`.`qcm_id` and `etudiant_id` = 10) as `mes_tentatives_count` from `qcms` where `est_publie` = 1 order by `created_at` desc